# NoHostForSubregionWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..NoHostForSubregionWarn Property
BuiltInFailures..::..SiteFailures Class See Also
---
This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoHostForSubregionWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoHostForSubregionWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoHostForSubregionWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace